**STEP 1: DATA CLEANING AND LOADING**

In [1]:
#importing dependencies


import pandas as pd

In [2]:
#verify pandas installed and its version

print(pd.__version__)
pd.set_option("display.expand_frame_repr", False)

2.2.3

In [3]:
#Loading the datasets

df = pd.read_csv('Walmart.csv', encoding_errors='ignore')

#gives me total number of rows and columns
df.shape

(10051, 11)

In [4]:
#we can see the head

df.head()

   invoice_id   Branch         City                category unit_price  quantity      date      time payment_method  rating  profit_margin
0           1  WALM003  San Antonio       Health and beauty     $74.69       7.0  05/01/19  13:08:00        Ewallet     9.1           0.48
1           2  WALM048    Harlingen  Electronic accessories     $15.28       5.0  08/03/19  10:29:00           Cash     9.6           0.48
2           3  WALM067  Haltom City      Home and lifestyle     $46.33       7.0  03/03/19  13:23:00    Credit card     7.4           0.33
3           4  WALM064      Bedford       Health and beauty     $58.22       8.0  27/01/19  20:33:00        Ewallet     8.4           0.33
4           5  WALM013       Irving       Sports and travel     $86.31       7.0  08/02/19  10:37:00        Ewallet     5.3           0.48

In [5]:
#get the stats of number column from data
df.describe()

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

In [7]:
#If this dataset has any duplicates, the way we are going to find all the duplicates is by using 

df.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
10046     True
10047     True
10048     True
10049     True
10050     True
Length: 10051, dtype: bool

In [8]:
# going to give me Total Number of duplicates Records TRUE
df.duplicated().sum()

np.int64(51)

In [9]:
df.duplicated().sum()

np.int64(51)

In [10]:
# Remove all Duplicates 
df.drop_duplicates(inplace=True)

In [11]:
#Verify if all Duplicates have been removed or not 
df.duplicated().sum()

np.int64(0)

In [12]:
#Now if we see the Shape the Data would have changed now 
df.shape

(10000, 11)

In [13]:
#Check if any missing values is there

df.isnull()

#isnull() is going to give us result in true or false

      invoice_id  Branch   City  category  unit_price  quantity   date   time  payment_method  rating  profit_margin
0          False   False  False     False       False     False  False  False           False   False          False
1          False   False  False     False       False     False  False  False           False   False          False
2          False   False  False     False       False     False  False  False           False   False          False
3          False   False  False     False       False     False  False  False           False   False          False
4          False   False  False     False       False     False  False  False           False   False          False
...          ...     ...    ...       ...         ...       ...    ...    ...             ...     ...            ...
9995       False   False  False     False       False     False  False  False           False   False          False
9996       False   False  False     False       False     False  False  False           False   False          False
9997       False   False  False     False       False     False  False  False           False   False          False
9998       False   False  False     False       False     False  False  False           False   False          False
9999       False   False  False     False       False     False  False  False           False   False          False

[10000 rows x 11 columns]

## To get the count of total nulls in data, use sum()

df.isnull().sum()

In [14]:
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

# So Now we have Removed All Duplicates

## We have still 31 Nulls to Fix

## There are 2 things we can do here:
### 1: Replace it with Some Other Values
### 2: OR Drop these 2 columns

### Let's Drop these Columns

In [15]:
#Dropping ALl Rows with Missing Records 
df.dropna(inplace=True)

## Let's Verify if Nulls have been Removed or Not

In [16]:
df.isnull().sum()

invoice_id        0
Branch            0
City              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

## At the Moment there are no missing Values as we have dropped it

## Let's Check the Shape

In [17]:
df.shape

(9969, 11)

## Now Data is almost clean, only issue is Unit Price column data type is showing as Object, which needs to be Converted to int Data type

## Return Each Columns Data Types

In [18]:
df.dtypes

invoice_id          int64
Branch             object
City               object
category           object
unit_price         object
quantity          float64
date               object
time               object
payment_method     object
rating            float64
profit_margin     float64
dtype: object

## As you can see here, unit_price data type is showing as object 
### To do any Calculation it must be Float or Int Type

## The Way you Convert Any Column is very simple

## Convert unit_price column to Float Data type by Type Casting using .astype(desiredDataType)

In [19]:
# This is going to give error when we run it 
df['unit_price'].astype(float)

ValueError: could not convert string to float: '$74.69'

### I'm going to use String Replace Function

### As it did not replace in Original DataFrame, it did only return a new DataFrame.
### In order to reflect those changes, we are going to assign df['unit_price'] column to the logic

In [ ]:
df['unit_price'] = df['unit_price'].str.replace('$','').astype(float)

In [ ]:
df.head()

   invoice_id   Branch         City                category  unit_price  quantity      date      time payment_method  rating  profit_margin
0           1  WALM003  San Antonio       Health and beauty       74.69       7.0  05/01/19  13:08:00        Ewallet     9.1           0.48
1           2  WALM048    Harlingen  Electronic accessories       15.28       5.0  08/03/19  10:29:00           Cash     9.6           0.48
2           3  WALM067  Haltom City      Home and lifestyle       46.33       7.0  03/03/19  13:23:00    Credit card     7.4           0.33
3           4  WALM064      Bedford       Health and beauty       58.22       8.0  27/01/19  20:33:00        Ewallet     8.4           0.33
4           5  WALM013       Irving       Sports and travel       86.31       7.0  08/02/19  10:37:00        Ewallet     5.3           0.48

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9969 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      9969 non-null   int64
 1   Branch          9969 non-null   object
 2   City            9969 non-null   object
 3   category        9969 non-null   object
 4   unit_price      9969 non-null   float64
 5   quantity        9969 non-null   float64
 6   date            9969 non-null   object
 7   time            9969 non-null   object
 8   payment_method  9969 non-null   object
 9   rating          9969 non-null   float64
 10  profit_margin   9969 non-null   float64
dtypes: float64(4), int64(1), object(6)
memory usage: 934.6+ KB

## Now that we have converted unit_price into Float - we can Get Total Price by Mutiplying it with quantity * unit_price

In [ ]:
df.columns

Index(['invoice_id', 'Branch', 'City', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin'],
      dtype='object')

In [ ]:
df['total']  = df['quantity'] * df['unit_price']

In [ ]:
df.head()

   invoice_id   Branch         City                category  unit_price  quantity      date      time payment_method  rating  profit_margin   total
0           1  WALM003  San Antonio       Health and beauty       74.69       7.0  05/01/19  13:08:00        Ewallet     9.1           0.48  522.83
1           2  WALM048    Harlingen  Electronic accessories       15.28       5.0  08/03/19  10:29:00           Cash     9.6           0.48   76.40
2           3  WALM067  Haltom City      Home and lifestyle       46.33       7.0  03/03/19  13:23:00    Credit card     7.4           0.33  324.31
3           4  WALM064      Bedford       Health and beauty       58.22       8.0  27/01/19  20:33:00        Ewallet     8.4           0.33  465.76
4           5  WALM013       Irving       Sports and travel       86.31       7.0  08/02/19  10:37:00        Ewallet     5.3           0.48  604.17

### To Connect with Database Engines, we need to install certain Libraries

### For PostgreSQL we need to install pyscopg2

In [20]:
#importing dependencies 

import psycopg2
from sqlalchemy import create_engine

### Let's Make a Connection

In [ ]:
# for PostgreSQL connection
# psql
# host = "localhost"
# port = "5432"
# user = "postgres"
# password = "102223"  # replace with your actual password

### We are going to Export this data into PostgreSQL -> Cleaned Data into Database

In [ ]:
df.shape

(9969, 11)

In [ ]:
df.to_csv('Walmart_cleaned.csv', index=False)

###  before importing the data to mySQL and postgress SQL I will need to make a connections with my python to postgress and MySQL

### PostgreSQL Connection

In [21]:
# psql connection
# Create engine
engine_psql = create_engine("postgresql+psycopg2://postgres:Admin@localhost:5432/walmart_db")

# Properly test the connection
try:
    with engine_psql.connect() as conn:
        print("âœ… Connection succeeded to PSQL")
except Exception as e:
    print("âŒ Unable to connect to PSQL")
    print(f"Error: {e}")

âœ… Connection succeeded to PSQL

In [22]:
df.columns

Index(['invoice_id', 'Branch', 'City', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin'],
      dtype='object')

### Converting All the Columns into LowerCase

In [23]:
df.columns = df.columns.str.lower()

In [25]:
df.columns

Index(['invoice_id', 'branch', 'city', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin'],
      dtype='object')

In [26]:
df.to_sql(name='walmart',con=engine_psql, if_exists= 'append', index= False)

969